package com.example.myfood.DB;

import android.annotation.SuppressLint;
import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;
import android.util.Log;


import com.example.myfood.Module.Food;

import java.util.ArrayList;

public class DBAdapter  extends SQLiteOpenHelper {


    //DDL
    SQLiteDatabase db;
    public static final String DB_NAME = "Store_Db";
    public static final int DB_VERSION = 16;

    public DBAdapter(Context context) {
        super(context, DB_NAME, null, DB_VERSION);
        db = getWritableDatabase();
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        db.execSQL(Food.CREATE_TABLE_PRODUCT);


        String sqlQuery1 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('كب كيك',"+"'المقادير\n" +
                "6 x عدد جبنة كيري (لكريمة الحشو)\n" +
                "2 x معلقة كبيرة سكر\n" +
                "1 x كوب حليب كامل الدسم (لكريمة الحشو)\n" +
                "1 x كوب كريمة مخفوقة (لكريمة الحشو)\n" +
                "1 x عدد حليب مكثف (لكريمة الحشو)\n" +
                "1 x معلقة كبيرة نشا (لكريمة الحشو)\n" +
                "½ x كوب سكر (لكريمة الحشو)\n" +
                "½ x كوب زبدة (سايحة)\n" +
                "½ x كيلو كنافة\n" +
                "¼ x كوب لبن بودرة (لكريمة الحشو)\n" +
                "الخطوات\n" +
                "نبدأ عمل كريمة الحشو نضع الحليب واللبن البودرة والسكر و كوب الكريمة ومعلقة النشا وندوب الخليط ونرفعه علي نار هادئة لغاية ما يتماسك وبعد ما نطفي النار نضيف مكعبات الجبنة ونقلب لغاية ما تدوب.\n" +
                "في الكبة نضرب الكنافة و معلقتين السكر والزبدة زي التشيز كيك.\n" +
                "في قالب الكب كيك نضع قليل من الكنافة ونضغط عليها كويس جدا ونتاكد انها غطت الجوانب كمان.\n" +
                "ناخد مقدار ملعقة من كريمة الحشو ونضعها في منتصف الكنافة ونغطيها بمقدار كنافة تانية ونقفلها.\n" +
                "نكمل مقدار الكنافة كلها وندخلها الفرن علي درجة 200 لغاية ما لونها يحمر.\n" +
                "نخرج الكنافة وهي ساخنة نسقيها بالحليب المكثف مقدار ملعقة كبيرة ونستني لما تتشربه الكنافة.\n" +
                "نخرج الكنافة من قوالب الكب كيك علي الوجه التاني ونسقيها كمان مرة بالحليب المكثف وبالهنا والشفا.',1,"+"'cubcake'"+")";



 String sqlQuery2 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('تارت موز',"+"'المقادير\n" +
         "5 x عدد موز\n" +
         "4 x معلقة كبيرة كاكاو\n" +
         "3 x معلقة كبيرة كسترد\n" +
         "3 x كوب لبن كامل الدسم\n" +
         "2 x كوب بسكوت (مطحون)\n" +
         "1 x كوب كريمة مخفوقة (للتزيين)\n" +
         "½ x كوب زبدة (بدرجة حرارة الغرفة)\n" +
         "½ x معلقة صغيرة قرفة\n" +
         "½ x كوب سكر\n" +
         "½ x كوب بندق (محمص)\n" +
         "\n" +
         "الخطوات\n" +
         "يسخن الفرن على درجة حرارة 180.\n" +
         "هنخلط البسكوت جيدا مع الزبدة والقرفة و2 معلقة سكر صغيرة.\n" +
         "هندهن القالب بالزبد ويفرد البسكوت فى القالب ويضغط علية باليد ويدخل الفرن لمدة عشر دقائق.\n" +
         "فى وعاء يخلط الكسترد واللبن البارد والسكر والكاكاو جيدا ثم يوضع على النار الى ان يغلظ القوام ويترك الخليط ليبرد.\n" +
         "يقطع الموز حلقات و ويرص فوق البسكوت.\n" +
         "يوضع كسترد الشوكولاته على البسكوت والموز ويدخل الثلاجه لمده 2 ساعه يزين بحلقات موز والكريمه المخفوقه ويقدم.',2,"+"'banana'"+")";




        String sqlQuery3 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('عجينة السمبوسك',"+"'المقادير\n" +
                "4 x معلقة كبيرة سمن\n" +
                "2 x عدد بيضة (طازجة)\n" +
                "2 x معلقة صغيرة ملح\n" +
                "2 x كوب دقيق\n" +
                "1 ½ x كوب زيت عباد شمس\n" +
                "1 x عدد بصلة (مفرومه)\n" +
                "1 x كوب لبن كامل الدسم (للعجن)\n" +
                "1 x معلقة صغيرة سكر\n" +
                "1 x معلقة صغيرة باكينج بودر\n" +
                "1 x معلقة صغيرة خل\n" +
                "1 x رشة جوزة الطيب\n" +
                "½ x معلقة صغيرة فلفل اسود مطحون\n" +
                "½ x كيلو لحمة مفرومة\n" +
                "\n" +
                "\n" +
                "الخطوات\n" +
                "فى وعاء نخلط الدقيق والباكينج بودر ونص معلقة ملح والسكر جيدا.\n" +
                "نضيف اللبن و2 معلقه سمن والخل ونخلط جيدا لمده دقيقتين حتى نحصل على عجينه ملساء.\n" +
                "نغلفها فى نايلون ونتركها ساعة لتخمر.\n" +
                "خلال الساعة نعصج اللحم ..نضع البصله مع معلقة 2 سمن على النار حتى تذبل ثم نضع اللحم ويتبل بالملح والفلفل وجوزه الطيب وتترك اللحم حتى تنضج.\n" +
                "نحضر العجينة نأخذ ثلثها وتفرد بالنشابه على سطح مرشوش بالدقيق.\n" +
                "تشكل العجينة باستخدام قطاعة دائرية.\n" +
                "نبلل حواف قطع السمبوسك بالماء ثم نضع معلقه من الحشو فى منتصف العجين ونغلقها على شكل نصف دائرة و نثبت الحواف جيدا ونضغط على الحواف بأطراف شوكة.\n" +
                "تقلى فى زيت ساخن غزير تقدم ساخنة .. بالهنا والشفا ',3,"+"'samosa'"+")";




        String sqlQuery4 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('مكرونة بشاميل',"+"'المقادير\n" +
                "3 x معلقة كبيرة سمن\n" +
                "3 x عدد بيضة (طازجة)\n" +
                "1 x كيس مكرونة (فرن)\n" +
                "1 x معلقة صغيرة ملح (أو حسب الرغبة)\n" +
                "½ x كيلو زبادي\n" +
                "½ x معلقة صغيرة فلفل اسود مطحون (أو حسب الرغبة)\n" +
                "¼ x كيلو جبنة بارميزان (أو رومى)\n" +
                "\n" +
                "الخطوات\n" +
                "هنسلق المكرونة فى ماء مغلى مع معلقة ملح لمدة 8 دقائق ثم تصفى.\n" +
                "فى وعاء نضع الزبادى مع البيض والسمن والجبن المبشور وملح وفلفل ونقلب جيدا.\n" +
                "ندهن صينية بالسمن ونضع المكرونة ونضع ربع الخليط ونقلب جيدا الخليط مع المكرونة ثم نضع باقى الخليط على الوجه.\n" +
                "نضع الصينيه فى الفرن الى ان تأخذ لون ذهبى شهى .. تقدم ساخنة. ',4,"+"'pizza_recip'"+")";


        String sqlQuery5 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('كب كيك',"+"'المقادير\n" +
                "6 x عدد جبنة كيري (لكريمة الحشو)\n" +
                "2 x معلقة كبيرة سكر\n" +
                "1 x كوب حليب كامل الدسم (لكريمة الحشو)\n" +
                "1 x كوب كريمة مخفوقة (لكريمة الحشو)\n" +
                "1 x عدد حليب مكثف (لكريمة الحشو)\n" +
                "1 x معلقة كبيرة نشا (لكريمة الحشو)\n" +
                "½ x كوب سكر (لكريمة الحشو)\n" +
                "½ x كوب زبدة (سايحة)\n" +
                "½ x كيلو كنافة\n" +
                "¼ x كوب لبن بودرة (لكريمة الحشو)\n" +
                "الخطوات\n" +
                "نبدأ عمل كريمة الحشو نضع الحليب واللبن البودرة والسكر و كوب الكريمة ومعلقة النشا وندوب الخليط ونرفعه علي نار هادئة لغاية ما يتماسك وبعد ما نطفي النار نضيف مكعبات الجبنة ونقلب لغاية ما تدوب.\n" +
                "في الكبة نضرب الكنافة و معلقتين السكر والزبدة زي التشيز كيك.\n" +
                "في قالب الكب كيك نضع قليل من الكنافة ونضغط عليها كويس جدا ونتاكد انها غطت الجوانب كمان.\n" +
                "ناخد مقدار ملعقة من كريمة الحشو ونضعها في منتصف الكنافة ونغطيها بمقدار كنافة تانية ونقفلها.\n" +
                "نكمل مقدار الكنافة كلها وندخلها الفرن علي درجة 200 لغاية ما لونها يحمر.\n" +
                "نخرج الكنافة وهي ساخنة نسقيها بالحليب المكثف مقدار ملعقة كبيرة ونستني لما تتشربه الكنافة.\n" +
                "نخرج الكنافة من قوالب الكب كيك علي الوجه التاني ونسقيها كمان مرة بالحليب المكثف وبالهنا والشفا.',5,"+"'cubcake'"+")";



        String sqlQuery6 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('تارت موز',"+"'المقادير\n" +
                "5 x عدد موز\n" +
                "4 x معلقة كبيرة كاكاو\n" +
                "3 x معلقة كبيرة كسترد\n" +
                "3 x كوب لبن كامل الدسم\n" +
                "2 x كوب بسكوت (مطحون)\n" +
                "1 x كوب كريمة مخفوقة (للتزيين)\n" +
                "½ x كوب زبدة (بدرجة حرارة الغرفة)\n" +
                "½ x معلقة صغيرة قرفة\n" +
                "½ x كوب سكر\n" +
                "½ x كوب بندق (محمص)\n" +
                "\n" +
                "الخطوات\n" +
                "يسخن الفرن على درجة حرارة 180.\n" +
                "هنخلط البسكوت جيدا مع الزبدة والقرفة و2 معلقة سكر صغيرة.\n" +
                "هندهن القالب بالزبد ويفرد البسكوت فى القالب ويضغط علية باليد ويدخل الفرن لمدة عشر دقائق.\n" +
                "فى وعاء يخلط الكسترد واللبن البارد والسكر والكاكاو جيدا ثم يوضع على النار الى ان يغلظ القوام ويترك الخليط ليبرد.\n" +
                "يقطع الموز حلقات و ويرص فوق البسكوت.\n" +
                "يوضع كسترد الشوكولاته على البسكوت والموز ويدخل الثلاجه لمده 2 ساعه يزين بحلقات موز والكريمه المخفوقه ويقدم.',6,"+"'banana'"+")";




        String sqlQuery7 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('عجينة السمبوسك',"+"'المقادير\n" +
                "4 x معلقة كبيرة سمن\n" +
                "2 x عدد بيضة (طازجة)\n" +
                "2 x معلقة صغيرة ملح\n" +
                "2 x كوب دقيق\n" +
                "1 ½ x كوب زيت عباد شمس\n" +
                "1 x عدد بصلة (مفرومه)\n" +
                "1 x كوب لبن كامل الدسم (للعجن)\n" +
                "1 x معلقة صغيرة سكر\n" +
                "1 x معلقة صغيرة باكينج بودر\n" +
                "1 x معلقة صغيرة خل\n" +
                "1 x رشة جوزة الطيب\n" +
                "½ x معلقة صغيرة فلفل اسود مطحون\n" +
                "½ x كيلو لحمة مفرومة\n" +
                "\n" +
                "\n" +
                "الخطوات\n" +
                "فى وعاء نخلط الدقيق والباكينج بودر ونص معلقة ملح والسكر جيدا.\n" +
                "نضيف اللبن و2 معلقه سمن والخل ونخلط جيدا لمده دقيقتين حتى نحصل على عجينه ملساء.\n" +
                "نغلفها فى نايلون ونتركها ساعة لتخمر.\n" +
                "خلال الساعة نعصج اللحم ..نضع البصله مع معلقة 2 سمن على النار حتى تذبل ثم نضع اللحم ويتبل بالملح والفلفل وجوزه الطيب وتترك اللحم حتى تنضج.\n" +
                "نحضر العجينة نأخذ ثلثها وتفرد بالنشابه على سطح مرشوش بالدقيق.\n" +
                "تشكل العجينة باستخدام قطاعة دائرية.\n" +
                "نبلل حواف قطع السمبوسك بالماء ثم نضع معلقه من الحشو فى منتصف العجين ونغلقها على شكل نصف دائرة و نثبت الحواف جيدا ونضغط على الحواف بأطراف شوكة.\n" +
                "تقلى فى زيت ساخن غزير تقدم ساخنة .. بالهنا والشفا ',7,"+"'samosa'"+")";




        String sqlQuery8 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('مكرونة بشاميل',"+"'المقادير\n" +
                "3 x معلقة كبيرة سمن\n" +
                "3 x عدد بيضة (طازجة)\n" +
                "1 x كيس مكرونة (فرن)\n" +
                "1 x معلقة صغيرة ملح (أو حسب الرغبة)\n" +
                "½ x كيلو زبادي\n" +
                "½ x معلقة صغيرة فلفل اسود مطحون (أو حسب الرغبة)\n" +
                "¼ x كيلو جبنة بارميزان (أو رومى)\n" +
                "\n" +
                "الخطوات\n" +
                "هنسلق المكرونة فى ماء مغلى مع معلقة ملح لمدة 8 دقائق ثم تصفى.\n" +
                "فى وعاء نضع الزبادى مع البيض والسمن والجبن المبشور وملح وفلفل ونقلب جيدا.\n" +
                "ندهن صينية بالسمن ونضع المكرونة ونضع ربع الخليط ونقلب جيدا الخليط مع المكرونة ثم نضع باقى الخليط على الوجه.\n" +
                "نضع الصينيه فى الفرن الى ان تأخذ لون ذهبى شهى .. تقدم ساخنة. ',8,"+"'macrona'"+")";

/*
 String sqlQuery4 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('بيتزا',"+"'بيتزا بيتزا ',4,"+"'pizza_recip'"+")";

 String sqlQuery5 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('سمبوسك',"+"'المقادير\n" +
         "5 x عدد موز\n" +
         "4 x معلقة كبيرة كاكاو\n" +
         "3 x معلقة كبيرة كسترد\n" +
         "3 x كوب لبن كامل الدسم\n" +
         "2 x كوب بسكوت (مطحون)\n" +
         "1 x كوب كريمة مخفوقة (للتزيين)\n" +
         "½ x كوب زبدة (بدرجة حرارة الغرفة)\n" +
         "½ x معلقة صغيرة قرفة\n" +
         "½ x كوب سكر\n" +
         "½ x كوب بندق (محمص)\n" +
         "\n" +
         "الخطوات\n" +
         "يسخن الفرن على درجة حرارة 180.\n" +
         "هنخلط البسكوت جيدا مع الزبدة والقرفة و2 معلقة سكر صغيرة.\n" +
         "هندهن القالب بالزبد ويفرد البسكوت فى القالب ويضغط علية باليد ويدخل الفرن لمدة عشر دقائق.\n" +
         "فى وعاء يخلط الكسترد واللبن البارد والسكر والكاكاو جيدا ثم يوضع على النار الى ان يغلظ القوام ويترك الخليط ليبرد.\n" +
         "يقطع الموز حلقات و ويرص فوق البسكوت.\n" +
         "يوضع كسترد الشوكولاته على البسكوت والموز ويدخل الثلاجه لمده 2 ساعه يزين بحلقات موز والكريمه المخفوقه ويقدم.',5,"+"'samosa'"+")";



        String sqlQuery6 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('كب كيك',"+"'المقادير\n" +
                "6 x عدد جبنة كيري (لكريمة الحشو)\n" +
                "2 x معلقة كبيرة سكر\n" +
                "1 x كوب حليب كامل الدسم (لكريمة الحشو)\n" +
                "1 x كوب كريمة مخفوقة (لكريمة الحشو)\n" +
                "1 x عدد حليب مكثف (لكريمة الحشو)\n" +
                "1 x معلقة كبيرة نشا (لكريمة الحشو)\n" +
                "½ x كوب سكر (لكريمة الحشو)\n" +
                "½ x كوب زبدة (سايحة)\n" +
                "½ x كيلو كنافة\n" +
                "¼ x كوب لبن بودرة (لكريمة الحشو)\n" +
                "الخطوات\n" +
                "نبدأ عمل كريمة الحشو نضع الحليب واللبن البودرة والسكر و كوب الكريمة ومعلقة النشا وندوب الخليط ونرفعه علي نار هادئة لغاية ما يتماسك وبعد ما نطفي النار نضيف مكعبات الجبنة ونقلب لغاية ما تدوب.\n" +
                "في الكبة نضرب الكنافة و معلقتين السكر والزبدة زي التشيز كيك.\n" +
                "في قالب الكب كيك نضع قليل من الكنافة ونضغط عليها كويس جدا ونتاكد انها غطت الجوانب كمان.\n" +
                "ناخد مقدار ملعقة من كريمة الحشو ونضعها في منتصف الكنافة ونغطيها بمقدار كنافة تانية ونقفلها.\n" +
                "نكمل مقدار الكنافة كلها وندخلها الفرن علي درجة 200 لغاية ما لونها يحمر.\n" +
                "نخرج الكنافة وهي ساخنة نسقيها بالحليب المكثف مقدار ملعقة كبيرة ونستني لما تتشربه الكنافة.\n" +
                "نخرج الكنافة من قوالب الكب كيك علي الوجه التاني ونسقيها كمان مرة بالحليب المكثف وبالهنا والشفا.',6,"+"'cubcake'"+")";



        String sqlQuery7 = "INSERT INTO " + Food.TABLE_NAME +"(name,description,id,image)"
                +" VALUES ('تارت موز',"+"'المقادير\n" +
                "5 x عدد موز\n" +
                "4 x معلقة كبيرة كاكاو\n" +
                "3 x معلقة كبيرة كسترد\n" +
                "3 x كوب لبن كامل الدسم\n" +
                "2 x كوب بسكوت (مطحون)\n" +
                "1 x كوب كريمة مخفوقة (للتزيين)\n" +
                "½ x كوب زبدة (بدرجة حرارة الغرفة)\n" +
                "½ x معلقة صغيرة قرفة\n" +
                "½ x كوب سكر\n" +
                "½ x كوب بندق (محمص)\n" +
                "\n" +
                "الخطوات\n" +
                "يسخن الفرن على درجة حرارة 180.\n" +
                "هنخلط البسكوت جيدا مع الزبدة والقرفة و2 معلقة سكر صغيرة.\n" +
                "هندهن القالب بالزبد ويفرد البسكوت فى القالب ويضغط علية باليد ويدخل الفرن لمدة عشر دقائق.\n" +
                "فى وعاء يخلط الكسترد واللبن البارد والسكر والكاكاو جيدا ثم يوضع على النار الى ان يغلظ القوام ويترك الخليط ليبرد.\n" +
                "يقطع الموز حلقات و ويرص فوق البسكوت.\n" +
                "يوضع كسترد الشوكولاته على البسكوت والموز ويدخل الثلاجه لمده 2 ساعه يزين بحلقات موز والكريمه المخفوقه ويقدم.',7,"+"'banana'"+")";

  */

        Log.e("amany",sqlQuery1);


        db.execSQL(sqlQuery1);
        db.execSQL(sqlQuery2);
        db.execSQL(sqlQuery3);
        db.execSQL(sqlQuery4);
        db.execSQL(sqlQuery5);
        db.execSQL(sqlQuery6);
        db.execSQL(sqlQuery7);
        db.execSQL(sqlQuery8);




    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        db.execSQL("DROP TABLE IF EXISTS " + Food.TABLE_NAME);
        onCreate(db);
    }


    //-------------------------------------------------------------------------
    //DML


    public boolean insertProduct(String name, String description, int id, String image) {
        ContentValues contentValues = new ContentValues();
        contentValues.put(Food.COL_NAME, name);
        contentValues.put(Food.COL_IMAGE, image);
        contentValues.put(Food.COL_DESCRIPTION, image);
        return db.insert(Food.TABLE_NAME, null, contentValues) > 0;
    }

    @SuppressLint("Range")
    public ArrayList<Food> getAllFoods() {
        ArrayList<Food> foods = new ArrayList<>();
        String SQLQuery ="Select * from "+Food.TABLE_NAME;
        Cursor c = db.rawQuery(SQLQuery,null);

        if(c.moveToFirst())
        {
            do{
                Food category=new Food();
                category.setId(c.getInt(c.getColumnIndex(Food.COL_ID)));
                category.setNameFood(c.getString(c.getColumnIndex(Food.COL_NAME)));
                category.setDescriptionFood(c.getString(c.getColumnIndex(Food.COL_DESCRIPTION)));
                category.setImageFood(c.getString(c.getColumnIndex(Food.COL_IMAGE)));
                foods.add(category);

            }while (c.moveToNext());
        }
        c.close();
        return foods;
    }


}
